<?php
$today = date("YmdHis");

// 出力情報の設定
header("Content-Type: application/octet-stream");
header("Content-Disposition: attachment; filename=" . $today . ".csv");
header("Content-Transfer-Encoding: binary");

try {
    // MySQLへの接続
    $pdo = new PDO('mysql:host=localhost;dbname=sinrinbo;charset=utf8', 'root', '');
    $pdo->setAttribute(PDO::ATTR_EMULATE_PREPARES, false);
    $pdo->setAttribute(PDO::ATTR_ERRMODE, PDO::ERRMODE_EXCEPTION);

    $sql = $_POST['csvsql'];
    $stm = $pdo->prepare($sql);
    $stm->execute();
    $result = $stm->fetchAll(PDO::FETCH_ASSOC);

    // 接続を閉じる
    $stm = null;
} catch (PDOException $e) { // PDOExceptionをキャッチする
    print $e->getMessage() . "<br/gt;";
    die();
}

// 1行目を作成
$row = '"年度","計画区","県事務所","新市町村","市町村","林班","準林班","小班","枝番","対象外","大字","字","地番","合併","現に所有者住所","現に所有者番号","現に所有者共有有無","林地所有者住所","林地所有者番号","林地所有者共有有無","林地更新年月日","登記所有者住所","所有規模","在不在","立木所有形態","林地所有形態","分収林","面積","施業方法","第1層区分","第1林種","第1針広別","第1樹種","第1歩合","第1林齢","第1齢級","第1面積","第1材積表","第1材積計算樹種","第1ＨＡ材積","第1蓄積","第2層区分","第2林種","第2針広別","第2樹種","第2歩合","第2林齢","第2齢級","第2面積","第2蓄積","第3林種","第3針広別","第3樹種","第3歩合","第3林齢","第3齢級","第3面積","第3蓄積","制普別","保安林1","保安林2","保安林3","伐採方法","自然公園法","砂防法","岐阜県自然環境保全条例","急傾斜地法","岐阜県立自然公園条例","鳥獣害防止森林区域","標準伐期齢","施業履歴","林道距離現在","標高","傾斜"' . "\n";
foreach ($result as $value) {
    $row .=
        '"' . $value['年度'] . '",' .
        '"' . $value['計画区'] . '",' .
        '"' . $value['県事務所'] . '",' .
        '"' . $value['n市町村'] . '",' .
        '"' . $value['o市町村'] . '",' .
        '"' . $value['林班'] . '",' .
        '"' . $value['j林班'] . '",' .
        '"' . $value['小班'] . '",' .
        '"' . $value['枝番'] . '",' .
        '"' . $value['対象外'] . '",' .
        '"' . $value['大字'] . '",' .
        '"' . $value['字'] . '",' .
        '"' . ' ' . $value['地番'] . '",' .
        '"' . $value['合併'] . '",' .
        '"' . $value['現に所有者住所'] . '",' .
        '"' . $value['現に所有者番号'] . '",' .
        '"' . $value['現に所有者共有有無'] . '",' .
        '"' . $value['林地所有者住所'] . '",' .
        '"' . $value['林地所有者番号'] . '",' .
        '"' . $value['林地所有者共有有無'] . '",' .
        '"' . $value['林地更新年月日'] . '",' .
        '"' . $value['登記所有者住所'] . '",' .
        '"' . $value['所有規模'] . '",' .
        '"' . $value['在不在'] . '",' .
        '"' . $value['立木所有形態'] . '",' .
        '"' . $value['林地所有形態'] . '",' .
        '"' . $value['分収林'] . '",' .
        '"' . $value['面積'] . '",' .
        '"' . $value['施業方法'] . '",' .
        '"' . $value['第1層区分'] . '",' .
        '"' . $value['第1林種'] . '",' .
        '"' . $value['第1針広別'] . '",' .
        '"' . $value['第1樹種'] . '",' .
        '"' . $value['第1歩合'] . '",' .
        '"' . $value['第1林齢'] . '",' .
        '"' . $value['第1齢級'] . '",' .
        '"' . $value['第1面積'] . '",' .
        '"' . $value['第1材積表'] . '",' .
        '"' . $value['第1材積計算樹種'] . '",' .
        '"' . $value['第1ＨＡ材積'] . '",' .
        '"' . $value['第1蓄積'] . '",' .
        '"' . $value['第2層区分'] . '",' .
        '"' . $value['第2林種'] . '",' .
        '"' . $value['第2針広別'] . '",' .
        '"' . $value['第2樹種'] . '",' .
        '"' . $value['第2歩合'] . '",' .
        '"' . $value['第2林齢'] . '",' .
        '"' . $value['第2齢級'] . '",' .
        '"' . $value['第2面積'] . '",' .
        '"' . $value['第2蓄積'] . '",' .
        '"' . $value['第3林種'] . '",' .
        '"' . $value['第3針広別'] . '",' .
        '"' . $value['第3樹種'] . '",' .
        '"' . $value['第3歩合'] . '",' .
        '"' . $value['第3林齢'] . '",' .
        '"' . $value['第3齢級'] . '",' .
        '"' . $value['第3面積'] . '",' .
        '"' . $value['第3蓄積'] . '",' .
        '"' . $value['制普別'] . '",' .
        '"' . $value['保安林1'] . '",' .
        '"' . $value['保安林2'] . '",' .
        '"' . $value['保安林3'] . '",' .
        '"' . $value['伐採方法'] . '",' .
        '"' . $value['自然公園法'] . '",' .
        '"' . $value['砂防法'] . '",' .
        '"' . $value['岐阜県自然環境保全条例'] . '",' .
        '"' . $value['急傾斜地法'] . '",' .
        '"' . $value['岐阜県立自然公園条例'] . '",' .
        '"' . $value['鳥獣害防止森林区域'] . '",' .
        '"' . $value['標準伐期齢'] . '",' .
        '"' . $value['施業履歴'] . '",' .
        '"' . $value['林道距離現在'] . '",' .
        '"' . $value['標高'] . '",' .
        '"' . $value['傾斜'] . '",'  . "\n";
}
print mb_convert_encoding($row, "SJIS", "UTF-8");
//print $row;

return;
